app/views/questions/show.html.erb

        <%= hidden_field_tag :question_id, @question.id %>
        <% @question.choices.each do |choice| %>
---
SELECT `choices`.* FROM `choices` WHERE `choices`.`question_id` = 9