app/controllers/api/user_sessions_controller.rb

    def create
      email = params[:email] || params.dig(:user, :email)
      password = params[:password] || params.dig(:user, :password)
      user = login(email, password)

      if user
        render json: { message: "ログインしました", user: user.as_json([:id, :name, :email]) }, status: :ok
      else
        errors = []
        user_record = User.find_by(email: email)
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'test@example.com' LIMIT 1