backend/app/models/api_user.rb

SELECT `achievement_symbols`.* FROM `achievement_symbols` WHERE (min_score <= '9') ORDER BY `achievement_symbols`.`min_score` DESC LIMIT 1
---
  def achievement_title
    score = api_challenges.maximum(:score) || 0
    symbol = AchievementSymbol.where("min_score <= ?", score).order(min_score: :desc).first