backend/app/models/user.rb

SELECT `achievement_symbols`.* FROM `achievement_symbols` WHERE (min_score <= '5') AND 1=1
SELECT `achievement_symbols`.* FROM `achievement_symbols` WHERE (min_score <= '10')
INSERT INTO `user_symbols` (`user_id`, `achievement_symbol_id`, `created_at`, `updated_at`) VALUES (2, 1, '2025-07-07 02:05:44.686352', '2025-07-07 02:05:44.686352')
---
  def update_symbols!
    return unless best_score

    # スコアを満たしているが、まだ持っていない称号だけ取得
    unlocked = AchievementSymbol.where("min_score <= ?", best_score)
    new_symbols = unlocked.where.not(id: achievement_symbol_ids)

    logger.debug "DEBUG: user best score = #{best_score}"
    logger.debug "DEBUG: unlocked symbols = #{unlocked.map(&:name)}"
    logger.debug "DEBUG: newly assigned symbols = #{new_symbols.map(&:name)}"

    new_symbols.each do |symbol|
      user_symbols.create!(achievement_symbol: symbol)