backend/app/controllers/answers_controller.rb

    def check
        puts "===== params ====="
        puts params.inspect
        puts "=================="

        current_question = Question.find_by(id: params[:question_id])

        # 未選択チェック
        if params[:choice_id].blank?
            redirect_to question_path(current_question), alert: "選択肢を選んでから回答してください！"
            return
        end

        # セッション保存
        choice = Choice.find(params[:choice_id])
---
SELECT `questions`.* FROM `questions` WHERE `questions`.`id` IS NULL LIMIT 1
SELECT `choices`.* FROM `choices` WHERE `choices`.`id` = 28 LIMIT 1

        # end

        # 全問終了チェック
        if session[:answered_questions].size >= Question.count
---
SELECT COUNT(*) FROM `questions`