backend/app/controllers/password_resets_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`email` = 'zzz@gmail.com' LIMIT 1
---
  def create
    email = params[:email]

    if email.blank?
      flash.now[:danger] = "メールアドレスを入力してください"
      render :new, status: :unprocessable_entity
      return
    end

    @user = User.find_by(email: email)

SELECT `users`.* FROM `users` WHERE `users`.`reset_password_token` = 'uC5JgPAuKWpMEEmimURp' ORDER BY `users`.`id` ASC LIMIT 1
---
  def edit
    @token = params[:id]
    @user = User.load_from_reset_password_token(params[:id])
    not_authenticated if @user.blank?

SELECT `users`.* FROM `users` WHERE `users`.`reset_password_token` = 'uC5JgPAuKWpMEEmimURp' ORDER BY `users`.`id` ASC LIMIT 1
---
  def update
    @token = params[:id]
    @user = User.load_from_reset_password_token(params[:id])

    if @user.blank?