backend/app/controllers/posts_controller.rb

SELECT `posts`.* FROM `posts`
---
  def index
    @posts = Post.all

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1
---
  def show
    @post = Post.find(params[:id])

INSERT INTO `posts` (`title`, `body`, `user_id`, `created_at`, `updated_at`) VALUES ('あ', 'あ', 11, '2025-06-21 01:17:24.273174', '2025-06-21 01:17:24.273174')
---
  def create
    @post = current_user.posts.build(post_params)

    if @post.save

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1
---
  def edit
    @post = Post.find(params[:id])

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1
DELETE FROM `posts` WHERE `posts`.`id` = 1
---
  def destroy
    @post = Post.find(params[:id])
    @post.destroy