backend/app/controllers/questions_controller.rb

SELECT `questions`.* FROM `questions` WHERE `questions`.`id` = 1 LIMIT 1
SELECT `questions`.* FROM `questions` WHERE 1=1 ORDER BY RAND() LIMIT 1
SELECT 1 AS one FROM `questions` WHERE 1=1 LIMIT 1
SELECT `questions`.* FROM `questions` WHERE `questions`.`id` != 3 ORDER BY RANDOM() LIMIT 1
---
  def show
    if params[:id] # ✅ /questions/:id にアクセスしたとき
      @question = Question.find(params[:id])
    else # ✅ /quiz にアクセスしたとき
      # session[:answered_questions] が nil なら空配列にする
      session[:answered_questions] ||= []
      # 出題していない問題の中からランダムに1問
      remaining_questions = Question.where.not(id: session[:answered_questions])

      if remaining_questions.exists?
        random_function = ActiveRecord::Base.connection.adapter_name.downcase.include?("mysql") ? "RAND()" : "RANDOM()"
        @question = remaining_questions.order(random_function).first