backend/app/controllers/rankings_controller.rb

SELECT users.*, COALESCE(SUM(challenges.score), 0) AS total_score FROM `users` LEFT OUTER JOIN `challenges` ON `challenges`.`user_id` = `users`.`id` GROUP BY `users`.`id` ORDER BY total_score DESC
SELECT users.*, MAX(challenges.score) AS best_score FROM `users` INNER JOIN `challenges` ON `challenges`.`user_id` = `users`.`id` GROUP BY `users`.`id` ORDER BY total_score DESC
---
  def index
    @users = User.joins(:challenges)
                 #  .left_outer_joins(:challenges) #チャレンジが無い人も含める
                 #  .select('users.*, COALESCE(SUM(challenges.score), 0) AS total_score') #合計スコアを計算（チャレンジがない人は0点）
                 .select("users.*, MAX(challenges.score) AS best_score")
                 .group("users.id") # ユーザーごとに集計
                 .order("best_score DESC") # スコアが高い順に並べる
                 .map do |u|