backend/app/controllers/results_controller.rb

SELECT COUNT(*) FROM `questions`
SELECT MAX(`challenges`.`score`) FROM `challenges` WHERE `challenges`.`user_id` = 1
INSERT INTO `challenges` (`user_id`, `score`, `created_at`, `updated_at`) VALUES (9, 5, '2025-06-17 00:53:20.213992', '2025-06-17 00:53:20.213992')
---
  def show
    flash.discard(:alert) # ✅ alertだけ消す

    session[:answered_questions] ||= []
    session[:correct_questions] ||= []
    session[:answers] ||= {}
    session[:scored] = false

    @answered_count = session[:answered_questions].count
    @total_questions = Question.count
    @all_answered = @answered_count == @total_questions

    unless session[:scored]
      correct_count = calculate_score(session[:answers])
      # current_user.challenges.create(score: correct_count)
      # session[:scored] = true  # 二重保存防止のフラグ
      if current_user.present?
        # ユーザーの現在の最高スコアを取得
        best_score = current_user.challenges.maximum(:score) || 0
        # 新しいスコアが自己ベストなら保存
        if correct_count > best_score
          current_user.challenges.create(score: correct_count)

SELECT `choices`.* FROM `choices` WHERE `choices`.`id` = 28 LIMIT 1
---
  def calculate_score(answers)
    correct_count = 0

    answers.each_value do |choice_id|
      choice = Choice.find(choice_id)