backend/app/controllers/user_sessions_controller.rb

  def create
    # Rails.logger.debug "🌐 ログイン試行 email: #{params[:email]}"
    # @user = login(params[:email], params[:password])
    # Rails.logger.debug "🌐 Sorcery login result: #{@user.inspect}"

    email = params[:user][:email]
    password = params[:user][:password]
    # Rails.logger.debug "🌐 ログイン試行 email: #{email}"
    @user = login(email, password)
    # Rails.logger.debug "🌐 Sorcery login result: #{@user.inspect}"

    if @user
      redirect_to userpage_path, notice: 'ログインしました'
    else
      @user = User.new(email: email)
      user_record = User.find_by(email: email)

      # メールアドレスのエラーチェック
      @user.errors.add(:email, 'を入力してください') if email.blank?

      @user.errors.add(:email, 'が登録されていません') if email.present? && user_record.nil?

      # パスワードのエラーチェック
      @user.errors.add(:password, 'を入力してください') if password.blank?

      @user.errors.add(:password, 'が間違っています') if user_record && password.present? && !User.authenticate(email, password)
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = '' LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`email` IS NULL LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'bbb@gmail.com' ORDER BY `users`.`id` ASC LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'rin.910491@gmail.com' ORDER BY `users`.`id` ASC LIMIT 1