backend/app/controllers/users_controller.rb

  def update
    if @user.update(user_params)
---
UPDATE `users` SET `users`.`name` = 'りんちゃん', `users`.`updated_at` = '2025-05-16 02:31:14.437403' WHERE `users`.`id` = 1

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO `users` (`name`, `email`, `crypted_password`, `salt`, `created_at`, `updated_at`, `reset_password_token`, `reset_password_token_expires_at`, `reset_password_email_sent_at`, `admin`) VALUES ('にな', 'slsk@gmail.com', '$2a$10$MQWbEuWY2v6Dsmajpsm2k.sMeS7Ek2MdkJOXI46kddU4JbwLvDBPC', '1d_b4mugfQt5pxYzaxXF', '2025-06-27 08:30:38.507728', '2025-06-27 08:30:38.507728', NULL, NULL, NULL, NULL)