backend/app/controllers/api/challenges_controller.rb

INSERT INTO `api_challenges` (`api_user_id`, `score`, `created_at`, `updated_at`) VALUES (2, 8, '2025-08-28 08:37:58.370335', '2025-08-28 08:37:58.370335')
INSERT INTO `challenges` (`user_id`, `score`, `created_at`, `updated_at`, `api_user_id`) VALUES (NULL, 8, '2025-08-28 07:25:23.755519', '2025-08-28 07:25:23.755519', 2)
SELECT `achievement_symbols`.* FROM `achievement_symbols` WHERE (min_score <= '8') ORDER BY `achievement_symbols`.`min_score` DESC LIMIT 1
INSERT INTO `user_symbols` (`user_id`, `achievement_symbol_id`, `created_at`, `updated_at`, `api_user_id`) VALUES (NULL, 4, '2025-08-28 07:25:23.815570', '2025-08-28 07:25:23.815570', 2)
---
    def create
      # スコア保存
      challenge = current_api_user.api_challenges.create!(score: params[:score])
      # スコアに応じた称号を判定
      symbol = AchievementSymbol.where("min_score <= ?", challenge.score)
                                .order(min_score: :desc)
                                .first
      if symbol
        current_best = current_api_user.achievement_symbols.order(min_score: :desc).first
        # より上位の称号なら更新
        if current_best.nil? || symbol.min_score > current_best.min_score
          current_api_user.user_symbols.create!(achievement_symbol: symbol)