backend/app/controllers/api/questions_controller.rb

    def index
      questions = Question.includes(:choices)
---
SELECT `choices`.* FROM `choices` WHERE `choices`.`question_id` IN (1, 2, 3, 4, 5, 6, 7, 8, 9, 10)
SELECT `questions`.* FROM `questions`

    def show
      question = Question.includes(:choices).find(params[:id])
---
SELECT `choices`.* FROM `choices` WHERE `choices`.`question_id` = 3

    def random
      random_function = ActiveRecord::Base.connection.adapter_name.downcase.include?("mysql") ? "RAND()" : "RANDOM()"
      question = Question.order(Arel.sql(random_function)).first
---
SELECT `questions`.* FROM `questions` ORDER BY RAND() LIMIT 1