backend/app/controllers/api/rankings_controller.rb

    def index
      # 各ユーザーの最高スコアを集計
      users_with_scores = ApiUser
                          .select('api_users.id, api_users.name, MAX(api_challenges.score) AS best_score')
                          .joins(:api_challenges)
                          .group('api_users.id')
                          .order(Arel.sql('MAX(api_challenges.score) DESC'))

      # 上位10名
      top_users = users_with_scores.limit(10)

      # 自分の順位
      user_ids = users_with_scores.pluck(:id)
      my_rank = user_ids.index(current_api_user&.id)&.+(1)

      my_entry = users_with_scores.find_by(id: current_api_user.id)
      my_best_score = my_entry&.best_score

      render json: {
        top_users: top_users.map do |u|
          latest_symbol = u.user_symbols.last&.achievement_symbol
---
SELECT api_users.id, api_users.name, MAX(api_challenges.score) AS best_score FROM `api_users` INNER JOIN `api_challenges` ON `api_challenges`.`api_user_id` = `api_users`.`id` GROUP BY `api_users`.`id` ORDER BY MAX(api_challenges.score) DESC
SELECT api_users.id, api_users.name, MAX(api_challenges.score) AS best_score FROM `api_users` INNER JOIN `api_challenges` ON `api_challenges`.`api_user_id` = `api_users`.`id` GROUP BY `api_users`.`id` ORDER BY MAX(api_challenges.score) DESC LIMIT 10
SELECT api_users.id, api_users.name, MAX(api_challenges.score) AS best_score FROM `api_users` INNER JOIN `api_challenges` ON `api_challenges`.`api_user_id` = `api_users`.`id` WHERE `api_users`.`id` = 9 GROUP BY `api_users`.`id` ORDER BY MAX(api_challenges.score) DESC LIMIT 1
SELECT `user_symbols`.* FROM `user_symbols` WHERE `user_symbols`.`api_user_id` = 9 ORDER BY `user_symbols`.`id` DESC LIMIT 1