backend/app/controllers/api/users_controller.rb

    def index
      users = ApiUser.select(:id, :email, :name)
---
SELECT `api_users`.`id`, `api_users`.`email`, `api_users`.`name` FROM `api_users`

    def show
      u = ApiUser.select(:id, :email, :name).find(params[:id])
---
SELECT `api_users`.`id`, `api_users`.`email`, `api_users`.`name` FROM `api_users` WHERE `api_users`.`id` = NULL LIMIT 1

    def mypage
      user = current_api_user
      best_symbol = user.achievement_symbols.order(min_score: :desc).first
---
SELECT `achievement_symbols`.* FROM `achievement_symbols` WHERE (min_score <= '9') ORDER BY `achievement_symbols`.`min_score` DESC LIMIT 1

    def create
      u = ApiUser.new(user_params)
      if u.save
---
INSERT INTO `api_users` (`name`, `email`, `encrypted_password`, `reset_password_token`, `reset_password_sent_at`, `remember_created_at`, `created_at`, `updated_at`) VALUES ('000000', 'test2@gmail.com', '$2a$12$n7NbS4lBvCudN6sZLQIezez2P3Nip/OV98Vb0EBc633DsLXfFj84u', NULL, NULL, NULL, '2025-08-25 07:59:15.361007', '2025-08-25 07:59:15.361007')

    def update_mypage
      user = current_api_user
      if user.update(user_update_params)
---
UPDATE `api_users` SET `api_users`.`name` = 'new', `api_users`.`email` = 'new@example.com', `api_users`.`updated_at` = '2025-09-02 03:36:25.868105' WHERE `api_users`.`id` = 2

    def update
      u = ApiUser.find(params[:id])
      if u.update(user_update_params)
---
SELECT `api_users`.* FROM `api_users` WHERE `api_users`.`id` = 2 ORDER BY `api_users`.`id` ASC LIMIT 1
UPDATE `api_users` SET `api_users`.`name` = '123456', `api_users`.`encrypted_password` = '$2a$12$rBDkXjVOByA0WHTZoVwVWubiCcmsS0tOz2rNnmq5v70dOpp8ii3Xa', `api_users`.`updated_at` = '2025-08-25 08:47:28.350524' WHERE `api_users`.`id` = 3

    def destroy
      u = ApiUser.find(params[:id])
      u.destroy!
---
SELECT `api_users`.* FROM `api_users` WHERE `api_users`.`id` = 2 ORDER BY `api_users`.`id` ASC LIMIT 1
DELETE FROM `api_users` WHERE `api_users`.`id` = 3