import { Link } from "react-router-dom";

export default function TermsPage() {
  return (
    <div style={{ padding: 20 }}>
      <h2>利用規約</h2>
      <p>
        本利用規約（以下「本規約」といいます。）は、○○（以下「当サービス」といいます。）の利用条件を定めるものです。
        ユーザーは、本サービスを利用することにより、本規約に同意したものとみなされます。
      </p>

      <p>
        第1条（適用）<br />
        本規約は、ユーザーと当サービスの運営者との間のサービス利用に関わる一切の関係に適用されます。
      </p>

      <p>
        第2条（利用登録）<br />
        1. ユーザーは、本規約に同意の上、所定の方法により利用登録を行うものとします。<br />
        2. 登録時に虚偽の情報を提供することを禁止します。
      </p>

      <p>
        第3条（アカウント管理）<br />
        1. ユーザーは、自己の責任においてアカウントおよびパスワードを管理するものとします。<br />
        2. アカウントを第三者に譲渡、貸与することはできません。
      </p>
      <Link to="/">
          トップページへ戻る
      </Link>
    </div>
  );
}
